RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/misc.h
/*
 **************************************************************************
 * Copyright (C) 2016 by ARTERY Technology Co., Ltd. All Rights Reserved.
 **************************************************************************
 * THIS SOURCE FILE IS DISTRIBUTED IN THE HOPE THAT CAN REDUCE EFFORTS AND
 * TIME, BUT WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED,
 * INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 **************************************************************************
 * File Name    : misc.h
 * Description  : at32f4xx MISC header file
 * Date         : 2018-02-26
 * Version      : V1.0.4
 **************************************************************************
 */


/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MISC_H
#define __MISC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "at32f4xx.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @addtogroup MISC
  * @{
  */

/** @defgroup MISC_Exported_Types
  * @{
  */

/**
  * @brief  NVIC Init Structure definition
  */

typedef struct
{
    uint8_t NVIC_IRQChannel;                        /*!< Specifies the IRQ channel to be enabled or disabled.
                                                       This parameter can be a value of @ref IRQn_Type
                                                       (For the complete AT32 Devices IRQ Channels list, please
                                                        refer to at32f4xx.h file) */

    uint8_t NVIC_IRQChannelPreemptionPriority;      /*!< Specifies the pre-emption priority for the IRQ channel
                                                       specified in NVIC_IRQChannel. This parameter can be a value
                                                       between 0 and 15 as described in the table @ref NVIC_Priority_Table */

    uint8_t NVIC_IRQChannelSubPriority;             /*!< Specifies the subpriority level for the IRQ channel specified
                                                       in NVIC_IRQChannel. This parameter can be a value
                                                       between 0 and 15 as described in the table @ref NVIC_Priority_Table */

    FunctionalState NVIC_IRQChannelCmd;             /*!< Specifies whether the IRQ channel defined in NVIC_IRQChannel
                                                       will be enabled or disabled.
                                                       This parameter can be set either to ENABLE or DISABLE */
} NVIC_InitType;

/**
  * @}
  */

/** @defgroup NVIC_Priority_Table
  * @{
  */

/**
@code
 The table below gives the allowed values of the pre-emption priority and subpriority according
 to the Priority Grouping configuration performed by NVIC_PriorityGroupConfig function
  ============================================================================================================================
    NVIC_PriorityGroup   | NVIC_IRQChannelPreemptionPriority | NVIC_IRQChannelSubPriority  | Description
  ============================================================================================================================
   NVIC_PriorityGroup_0  |                0                  |            0-15             |   0 bits for pre-emption priority
                         |                                   |                             |   4 bits for subpriority
  ----------------------------------------------------------------------------------------------------------------------------
   NVIC_PriorityGroup_1  |                0-1                |            0-7              |   1 bits for pre-emption priority
                         |                                   |                             |   3 bits for subpriority
  ----------------------------------------------------------------------------------------------------------------------------
   NVIC_PriorityGroup_2  |                0-3                |            0-3              |   2 bits for pre-emption priority
                         |                                   |                             |   2 bits for subpriority
  ----------------------------------------------------------------------------------------------------------------------------
   NVIC_PriorityGroup_3  |                0-7                |            0-1              |   3 bits for pre-emption priority
                         |                                   |                             |   1 bits for subpriority
  ----------------------------------------------------------------------------------------------------------------------------
   NVIC_PriorityGroup_4  |                0-15               |            0                |   4 bits for pre-emption priority
                         |                                   |                             |   0 bits for subpriority
  ============================================================================================================================
@endcode
*/

/**
  * @}
  */

/** @defgroup MISC_Exported_Constants
  * @{
  */

/** @defgroup Vector_Table_Base
  * @{
  */

#define NVIC_VectTab_RAM                    ((uint32_t)0x20000000)
#define NVIC_VectTab_FLASH                  ((uint32_t)0x08000000)
#define IS_NVIC_VECTTAB(VECTTAB)            (((VECTTAB) == NVIC_VectTab_RAM) || \
                                             ((VECTTAB) == NVIC_VectTab_FLASH))
/**
  * @}
  */

/** @defgroup System_Low_Power
  * @{
  */

#define NVIC_LP_SEVONPEND                   ((uint8_t)0x10)
#define NVIC_LP_SLEEPDEEP                   ((uint8_t)0x04)
#define NVIC_LP_SLEEPONEXIT                 ((uint8_t)0x02)
#define IS_NVIC_LP(LP)                      (((LP) == NVIC_LP_SEVONPEND) || \
                                             ((LP) == NVIC_LP_SLEEPDEEP) || \
                                             ((LP) == NVIC_LP_SLEEPONEXIT))
/**
  * @}
  */

/** @defgroup Preemption_Priority_Group
  * @{
  */

#define NVIC_PriorityGroup_0                ((uint32_t)0x700) /*!< 0 bits for pre-emption priority
                                                                   4 bits for subpriority */
#define NVIC_PriorityGroup_1                ((uint32_t)0x600) /*!< 1 bits for pre-emption priority
                                                                   3 bits for subpriority */
#define NVIC_PriorityGroup_2                ((uint32_t)0x500) /*!< 2 bits for pre-emption priority
                                                                   2 bits for subpriority */
#define NVIC_PriorityGroup_3                ((uint32_t)0x400) /*!< 3 bits for pre-emption priority
                                                                   1 bits for subpriority */
#define NVIC_PriorityGroup_4                ((uint32_t)0x300) /*!< 4 bits for pre-emption priority
                                                                   0 bits for subpriority */

#define IS_NVIC_PRIORITY_GROUP(GROUP)       (((GROUP) == NVIC_PriorityGroup_0) || \
                                             ((GROUP) == NVIC_PriorityGroup_1) || \
                                             ((GROUP) == NVIC_PriorityGroup_2) || \
                                             ((GROUP) == NVIC_PriorityGroup_3) || \
                                             ((GROUP) == NVIC_PriorityGroup_4))

#define IS_NVIC_PREEMPTION_PRIORITY(PRIORITY)       ((PRIORITY) < 0x10)

#define IS_NVIC_SUB_PRIORITY(PRIORITY)              ((PRIORITY) < 0x10)

#define IS_NVIC_OFFSET(OFFSET)                      ((OFFSET) < 0x000FFFFF)

/**
  * @}
  */

/** @defgroup SysTick_clock_source
  * @{
  */

#define SysTick_CLKSource_HCLK_Div8         ((uint32_t)0xFFFFFFFB)
#define SysTick_CLKSource_HCLK              ((uint32_t)0x00000004)
#define IS_SYSTICK_CLK_SOURCE(SOURCE)       (((SOURCE) == SysTick_CLKSource_HCLK) || \
                                             ((SOURCE) == SysTick_CLKSource_HCLK_Div8))
/**
  * @}
  */

/**
  * @}
  */

/** @defgroup MISC_Exported_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup MISC_Exported_Functions
  * @{
  */

void NVIC_PriorityGroupConfig(uint32_t NVIC_PriorityGroup);
void NVIC_Init(NVIC_InitType* NVIC_InitStruct);
void NVIC_SetVectorTable(uint32_t NVIC_VectTab, uint32_t Offset);
void NVIC_SystemLPConfig(uint8_t LowPowerMode, FunctionalState NewState);
void SysTick_CLKSourceConfig(uint32_t SysTick_CLKSource);

#ifdef __cplusplus
}
#endif

#endif /* __MISC_H */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


